{
    "BIOSC": [
        "{\n    \"className\": \"ANATOMY FOR THE HEALTH PROFESSIONS\",\n    \"classNumber\": \"0041\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This lecture course is designed to meet anatomy pre-requisites for students who are applying for admission to health profession programs but does not count towards any of the majors in biological sciences. Students will explore human functional and clinical gross anatomy organized by body region. Imaging techniques, disease pathologies, and case studies are utilized to enhance and apply lecture information. Co-enrollment with BIOSC 0042 is required.\",\n    \"id\": \"BIOSC0041\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0042 (Min Grade 'C')\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"ANATOMY FOR THE HEALTH PROFESSIONS LABORATORY\",\n    \"classNumber\": \"0042\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This laboratory course is designed to meet anatomy pre-requisites for students who are applying for admission to health profession programs but does not count towards any of the majors in biological sciences. This laboratory provides a visual opportunity to learn human anatomy through various tools, including skeletons, organ models, pathology specimens, virtual dissection, and histology slides. Lab modules are organized by body region. Co-enrollment with BIOSC 0041 is required.\",\n    \"id\": \"BIOSC0042\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0041 (Min Grade 'C')\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"FOUNDATIONS OF BIOLOGY RESEARCH  LABORATORY 1\",\n    \"classNumber\": \"0057\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This research-focused first-semester introductory biology lab uses real research projects to introduce biology as an experimental science. Students learn current laboratory techniques through an inquiry-based project or set of projects throughout the semester.  Experiments can focus on genetics, molecular biology, evolution, and ecology. Topic for each section is listed under Meeting Information.\",\n    \"id\": \"BIOSC0057\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0150 or 0715 or 0170 or 0190 or BIOL 0101 or 0110 (MIN GRADE\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"FOUNDATIONS OF BIOLOGY SEA-PHAGES LABORATORY 1\",\n    \"classNumber\": \"0058\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This is the first half of a two-part introductory biology lab that uses bacteriophage discovery to introduce biology as an experimental science. Students learn current laboratory techniques through discovery, isolation, and characterization of their own novel virus. Students will be introduced to concepts in microbiology, evolution, and molecular biology through hands-on experiments driven by results obtained during class. Students are expected to continue to the second half of the lab in BIOSC 0068.\",\n    \"id\": \"BIOSC0058\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"Freshman or Sophomore\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"FOUNDATIONS OF BIOLOGY RESEARCH LABORATORY 2\",\n    \"classNumber\": \"0067\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This research-focused second-semester introductory biology lab uses real research projects to introduce biology as an experimental science. Students learn current laboratory techniques through an inquiry-based project or set of projects throughout the semester.  Experiments can focus on genetics, molecular biology, evolution, and ecology.  Topic for each section is listed under Meeting Information.\",\n    \"id\": \"BIOSC0067\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0050 or 0057 or 0058 or 0070 or 0190 or BIOL 0101 or 0111) and (BIOSC 0160 or 0180 or 0716 or BIOL 0102 or 0120); Min Grade 'C'\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"PREPARATION FOR BIOLOGY\",\n    \"classNumber\": \"0100\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course is intended for students who have not had high school biology in the past five years.  The course is also highly recommended for students who have not completed algebra.  The lecture will over a subset of topics from foundations of biology 1 and 2, including a discussion of basic chemistry used in biology, cell biology including mitosis and meiosis, human anatomy and physiology, and an introduction to genetics.  The weekly recitations will explore topics covered in lecture in more depth and integrate problem solving and study skills.  Some laboratory exercises will be included in the recitation period to re-enforce the lecture topics by giving students the opportunity to investigate the experimental aspect of biology.  The laboratory exercises and assignments will focus on basic math and writing skills.\",\n    \"id\": \"BIOSC0100\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"FOUNDATIONS OF BIOLOGY 1\",\n    \"classNumber\": \"0150\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This introductory course in biology is divided into two parts.  The first part covers the cellular basis of life including a discussion of simple chemistry; cells as units of structure and function; and energy transformations.  The second part includes an examination of those functions common to all organisms such as nutrition, gas and fluid transport, and hormonal and neuronal control.  Throughout, the emphasis is on the mechanisms used to accomplish these basic functions.\",\n    \"id\": \"BIOSC0150\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"Pre-Assessment is required, instructions for completing the pre-assessment are found at\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"FOUNDATIONS OF BIOLOGY 2\",\n    \"classNumber\": \"0160\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This introductory course covers the basic principles of genetics, evolution, and ecology.  Emphasis will be placed on the experimental and observational basis for our knowledge of these subjects.\",\n    \"id\": \"BIOSC0160\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0150 or 0715 or 0170 or 0190) or (BIOL 0101 or 0110); Min Grade 'C'\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"GENETICS\",\n    \"classNumber\": \"0350\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course is designed to examine the gene in the following dimensions:  the gene as a unit of transmission, a unit of function, and a unit of mutation.  In addition, the distribution and activity of genes in populations will be considered in the context of current theories of evolution.\",\n    \"id\": \"BIOSC0350\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180) or (BIOENG 1071 or 1072) or (BIOL 0102 or 0120) and (CHEM 0120 or 0102 or 0112 or 0420 or 0720 or 0770 or 0970); Min Grade 'C'\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"ECOLOGY\",\n    \"classNumber\": \"0370\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"The objective of the course is to provide a broad introduction to the study of ecology at the undergraduate level, through the presentation of lectures dealing with organismal, population, community, and ecosystem levels of hierarchical organization.  The contributions of laboratory and field investigations to the development of ecological knowledge will be considered.\",\n    \"id\": \"BIOSC0370\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0160 or 0716 or 0191 or 0180 or BIOL 0102 or 0120; Min Grade 'C' for all classes listed.\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"ECOLOGY LABORATORY\",\n    \"classNumber\": \"0390\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"The objective of the laboratory course is to provide students with practical experience in ecological methods and in the design, conduct, and analysis of ecological studies.  Laboratory exercises are designed to correspond with major lecture topics presented in BIOSC 0370.  Exercises will include laboratory and field studies.\",\n    \"id\": \"BIOSC0390\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0060 or 0067 or 0068 or 0080 or 0191 or BIOL 0102 or 0121; CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"ECOLOGY LABORATORY WRITING PRACTICUM\",\n    \"classNumber\": \"0391\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"Course is a writing practicum for ecology laboratory, BIOSC 0390.  Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 0390.  The reports and essays will be returned with instructor comments for student revision and resubmission.\",\n    \"id\": \"BIOSC0391\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"ENG 0102 or ENGCMP (0002 or 0006 or 0020 or 0200 or 0203 or 0205 or 0207 or 0208 or 0210 or 0212) or ENGFLM 0210 or FP (0003 or 0006); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"UHC FOUNDATIONS OF BIOLOGY 1\",\n    \"classNumber\": \"0715\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course covers biological phenomena at the cellular level: macromolecules, cell structure, photosynthesis, cell respiration, homeostasis, signaling and genetics. The experimental basis supporting our understanding of these processes will be introduced.\",\n    \"id\": \"BIOSC0715\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"Advanced Placement Biology Test Score equal/greater 4 or International Baccalaureate Biology Score equal/greater 5\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"THE HUMAN BODY FOR NON-MAJORS\",\n    \"classNumber\": \"0805\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This is a course in human biology and physiology for students not majoring in biology.  The goal is to provide students with an understanding of fundamental principles of life with an emphasis on the human body.  The course will cover basic biochemistry and cell biology and then move to the structure and function of human organ systems.  An essential part of the course is discussion of current issues, such as infectious, autoimmune and neurodegenerative diseases; asthma and allergy; nutrition and health; stem cells research and cloning; and methods of contraception and reproductive technologies.\",\n    \"id\": \"BIOSC0805\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"BIOCHEMISTRY\",\n    \"classNumber\": \"1000\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course is designed to provide students with a basic understanding of the principles and underlying themes of modern biochemistry.  The course includes all the major topics in biochemistry in considerable depth including thermodynamics and enzymology, protein and nucleic acid structure, function, and synthesis, lipids and membranes as well as metabolic pathways. This course will require that you master a new vocabulary including chemical structures, and there is an emphasis throughout on experimental approaches, molecular mechanisms, and problem solving.  Although the same topics will be covered as in the two semester biochemistry series (BIOSC 1810-1820), no one topic in BIOSC 1000 will be covered in as much detail.\",\n    \"id\": \"BIOSC1000\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOENG 1071 or BIOENG 1072 or BIOL 0102 or 0120 and (CHEM 0120 or 0102 or 0112 or 0420 or 0720 or 0770 or 0970) (Min Grade 'C' for these courses) and (CHEM 0310 or 0350 or 0730 or 0206 or 0231)\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"INTRODUCTION TO BIOCHEMISTRY LAB\",\n    \"classNumber\": \"1005\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This course will guide students through a common experimental approach that is used in academic and industry research labs.  In the first part of the semester, students will clone genes that have been selected because they are new genes of interest to research labs within the department.  In the second part of the semester, students will express their cloned genes and purify the encoded proteins.  They will use computer analysis to predict possible functions of their proteins and then test their hypotheses using biochemical techniques.\",\n    \"id\": \"BIOSC1005\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0060 or 0067 or 0068 or 0080 or 0191) or (BIOL 0102 or 0121); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"COMMUNICATING IN THE BIOLOGICAL SCIENCES\",\n    \"classNumber\": \"1010\",\n    \"coreq\": [],\n    \"credits\": \"2 units\",\n    \"description\": \"Conventions of scientific communication will be taught in this junior/senior level course as students research, write and revise a position article and oral presentation about a biological controversy. Students will learn to locate information from peer-reviewed scientific literature in electronic databases. Through peer review exercises, students will develop evaluation skills and learn to incorporate feedback. Document design, argument construction, and readability will be taught and practiced with the goal of producing a clear and concise written document and oral presentation.\",\n    \"id\": \"BIOSC1010\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"PREQ:(BIOSC 0350or0355or0370or0371or1000or1810or1130)or(BIOL 0203or0350or1430or1515);MinGrad 'C';and(PREQ:ENG0102orENGCMP(0002or0006or 0020or0200or0203or0205or0207or0208or0210or0212) or ENGFLM 0210 or FP (0003 or 0006);LVL:JrorSr;PLAN:BIOSC-BS\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"HUMAN PHYSIOLOGY-UHC\",\n    \"classNumber\": \"1070\",\n    \"coreq\": [],\n    \"credits\": \"4 units\",\n    \"description\": \"After a general introduction on cell biology, muscle physiology, and intracellular communication, this course will examine the function of the following systems:  cardiovascular, respiratory, renal, gastrointestinal and immune.  The systems will be considered in the context of the function of the body as a whole, and how they respond during challenges (e.g. exercise) and pathological states.  Current research related to the functioning of these systems will be emphasized throughout the course.\",\n    \"id\": \"BIOSC1070\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"3.25\\n\\nPREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"BIOSTATISTICS\",\n    \"classNumber\": \"1120\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course provides students the knowledge on applications of statistical technique to biological problems.  The data fit, regression analysis, significance of correlation coefficient and of standard error of estimate will be discussed. The binomial, normal, and Poisson distributions, the student's t-distribution and the chi-squared distribution will be introduced.  Hypothesis testing, significance levels, confidence limits for large and small samples and non-para metric statistics will be covered.  Basic computer programming (use of BMDP and statview) will be introduced.\",\n    \"id\": \"BIOSC1120\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOL 0102 or 0120) and (BIOSC 0350 or 0355 or 0370 or 0371 or 1000 or 1810 or BIOL 0203 or 0350 or 1430 or 1515) and STAT 1000; MIN GRADE 'C' for all courses\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"VERTEBRATE MORPHOLOGY\",\n    \"classNumber\": \"1200\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"A study of the gross anatomy, histology, development, and evolution of the vertebrate body.  Topics:  vertebrate origin, phylogeny, and classification; basic histology; early embryology; evolutionary morphology; integument; skeletal system; muscular system; sense organs; nervous system; endocrine system;  body cavity and mesenteries; digestive system; respiratory system; circulatory system; excretory system; reproductive system.  Each system is examined in terms of its embryonic development, histology, functional anatomy, and evolutionary history.  General principles of evolutionary morphology are emphasized.  The purpose of the course is to provide an understanding of the history and functional anatomy of the body.  It is designed as a background for studies in embryology, physiology, systematics, and human anatomy and physiology in professional schools.\",\n    \"id\": \"BIOSC1200\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0160 or 0716 or 0191 or 0180 or BIOL 0102 or 0120; Min Grade 'C' for all courses listed\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"VERTEBRATE MORPHOLOGY LAB\",\n    \"classNumber\": \"1205\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This is a laboratory to accompany BIOSC 1200.  Students will dissect a shark and a cat, study various skeletons, and examine histology slides.  The purposes of the course are to illustrate the structures discussed in the BIOSC 1200 lectures and to give the student the personal experience of learning animal structure through dissection and observation.\",\n    \"id\": \"BIOSC1205\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0060 or 0067 or 0068 or 0080 or 0191) or (BIOL 0102 or 0121); CREQ\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"URBAN ECOLOGICAL FIELD STUDIES\",\n    \"classNumber\": \"1221\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This course provides extensive field experience for undergraduates and will focus on developing the skills necessary for any practicing ecologist. Students will be involved in all stages of field projects including both individual and group exercises. Using a combination of lecture, extensive readings from the primary literature and hands-on field projects, the instructor will assist the students in gaining a proficiency with the background knowledge, thinking skills and technological tools necessary to conduct empirical ecological investigations.\",\n    \"id\": \"BIOSC1221\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0060 or 0067 or 0068 or 0080 or 0191 or BIOL 0102 or 0121) and (BIOSC 0370 or 0371 or BIOL 1430 or 1515); Min Grade 'C' for all courses listed.\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"HUMAN PHYSIOLOGY\",\n    \"classNumber\": \"1250\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"After a general introduction on cell biology, physiology of nerves and muscle, and intercellular communication, this course will survey the function of the following systems:  cardiovascular, respiratory, renal, and gastrointestinal.  Each system discussed will be integrated into the larger function of homeostatic and their adaptation during pathology and challenges (e.g., exercise).\",\n    \"id\": \"BIOSC1250\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOENG 1071 or BIOENG 1072 or BIOL 0102 or 0120) and (CHEM 0120 or 0102 or 0112 or 0420 or 0720 or 0770 or 0970);Min Grade 'C' for these courses\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"POPULATION BIOLOGY\",\n    \"classNumber\": \"1320\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course focuses on ecological and evolutionary processes at the population level.  We will learn how to represent ecological and evolutionary dynamics using increasingly realistic mathematical models.  We will first explore population ecology including models of single populations, meta-populations, and interactions between species.  We then shift to population and evolutionary genetics studying how the mechanisms of evolution interact with each other.  Finally, we will study the explicit interaction between ecological and evolutionary processes that can occur over short timescales.\",\n    \"id\": \"BIOSC1320\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0370 or 0371 or BIOL 1430 or 1515; Min Grade 'C' for all courses listed\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"PLANT BIOLOGY\",\n    \"classNumber\": \"1350\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course will present an in-depth discussion of plant structure, function, and development in an ecological and evolutionary context.  In addition, this course will survey the plant kingdom and related taxa with a focus on the evolution of these groups.\",\n    \"id\": \"BIOSC1350\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0160 or 0716 or 0191 or 0180 or BIOL 0102 or 0120; Min Grade 'C' for all courses listed\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"CELL BIOLOGY\",\n    \"classNumber\": \"1500\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course will be devoted to a discussion of the current state of our understanding of cell structure and function.  Eukaryotic cells will be emphasized with particular attention to animal cells.  However, prokaryotic cells will be discussed for comparative purposes.  Course material will emphasize the experimental basis for our understanding of cell biology and the relationship between structure and function.  Most of the techniques to be considered will involve biochemical and molecular biological approaches used in the study of cell function.  Thus the course will assume a familiarity with the principles of biochemistry covered in the prerequisites and will not repeat this material.  Topics will include membranes, the nucleus, mitochondria and chloroplasts, the cytoskeleton, cell motility, growth and division, endocytosis and exocytosis, and selected topics on the cellular biological aspects of cancer and the immune system.\",\n    \"id\": \"BIOSC1500\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 1000 or 1810 (MIN GRADE 'C')\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"CELL BIOLOGY LABORATORY\",\n    \"classNumber\": \"1510\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This experimental methods course is designed to give upper division majors and opportunity to learn modern techniques used in cell biology research. Students will master the fundamentals of light microscopy (bright field, phase contrast, and dark field) and explore more advanced techniques such as fluorescence, confocal, video, and differential interference contrast microscopy.  Students will isolate plasma membranes, mitochondria, nuclei, brush borders, and flagella and characterize these organelles by microscopy, enzyme assays and antibody labeling.\",\n    \"id\": \"BIOSC1510\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0060 or 0067 or 0068 or 0191 or 0080) or (BIOL 0102 or 0121); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"CELL BIOLOGY LABORATORY WRITING PRACTICUM\",\n    \"classNumber\": \"1511\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"This course is the writing practicum for cell biology laboratory, BIOSC 1510.  Students will prepare laboratory reports based on exercises and assignments for the companion course, BIOSC 1510.\",\n    \"id\": \"BIOSC1511\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"ENG 0102 or ENGCMP (0002 or 0006 or 0020 or 0200 or 0203 or 0205 or 0207 or 0208 or 0210 or 0212) or ENGFLM 0210 or FP (0003 or 0006); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"COMPUTATIONAL BIOLOGY\",\n    \"classNumber\": \"1540\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course is designed to give students a broad understanding of how computational approaches can be used to solve problems in biology.  Both the biological and computational underpinnings of the methods will be addressed.\",\n    \"id\": \"BIOSC1540\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0180 or 0191or 0716) or (BIOL 0102 or 0120) (MIN GRADE 'C')\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"THE MATHEMATICS OF BIOLOGY\",\n    \"classNumber\": \"1545\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course uses examples from across biology to illustrate how simple mathematical models can increase our understanding of biological systems. We will focus on several foundational modeling approaches, including systems of difference equations, matrix models, probability, and statistical data analysis. Students will discover how these approaches are used, their strengths and limitations, and how they could be extended to more complex problems. Students should be prepared to use both spreadsheet programs and scripts, written in a language such as Python or R, to explore these models.\",\n    \"id\": \"BIOSC1545\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOL 0102 or 0120) and (MATH 0220 or 0221); MIN GRADE `C\\u00bf\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"SPECIAL TOPICS IN BIOLOGICAL SCIENCE\",\n    \"classNumber\": \"1590\",\n    \"coreq\": [],\n    \"credits\": 0,\n    \"description\": \"\",\n    \"id\": \"BIOSC1590\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"BIOINFORMATICS SOFTWARE DESIGN\",\n    \"classNumber\": \"1640\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course will develop software for bioinformatics applications.\",\n    \"id\": \"BIOSC1640\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 1540 or CS 1501 (MIN GRADE 'C'); PLAN\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"EXPERIENCE IN UNDERGRADUATE TEACHING\",\n    \"classNumber\": \"1690\",\n    \"coreq\": [],\n    \"credits\": 0,\n    \"description\": \"\",\n    \"id\": \"BIOSC1690\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MACROMOLECULAR STRUCTURE AND FUNCTION\",\n    \"classNumber\": \"1810\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course is concerned primarily with the structure and functions of proteins and nucleic acids.  These are large polymers where structure and function are determined by the sequence of monomeric units.  Topics will include the physical and chemical properties of the monomer units (amino acids/nucleotides); the determination of the linear sequence of these units; analyses of the three-dimensional structures of the macromolecules; kinetics and mechanisms of enzyme catalyzed reactions, including RNA enzymes; regulation of enzyme activity; molecular recognition; and fidelity of protein synthesis.  Emphasis throughout will be on experimental methods, molecular mechanisms and problem solving.\",\n    \"id\": \"BIOSC1810\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOENG 1071 or BIOENG 1072 or BIOL 0102 or 0120 ) (MIN GRADE 'C') and (CHEM 0320 or 0350 or 0740 or 0208 or 0232)\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MICROBIOLOGY\",\n    \"classNumber\": \"1850\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course will introduce students to the basic biology, diversity in types, and survival strategies of microorganisms.  We will study basic topics, including microbial growth, metabolism, nutrition and genetics, as well as the relevance of microorganisms to human disease, biotechnology and environmental science.\",\n    \"id\": \"BIOSC1850\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0160 or 0716 or 0191 or 0180 or BIOENG 1071 or 1072 or BIOL 0102 or 0120) and (CHEM 0120 or 0102 or 0112 or 0420 or 0720 or 0770 or 0970);Min Grade 'C' for these courses\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"INTRODUCTION TO MICROBIOLOGY LABORATORY\",\n    \"classNumber\": \"1855\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"Students in this course will culture microorganisms from natural samples such as soil, vegetables, and their own skin, and learn various methods in the process of studying the organisms they have cultured.  The topics for the course include (a) survey types of microorganisms, including bacteria, fungi, protozoa, algae, and bacterial viruses,  (b) types of methods used to culture and study these microorganisms,  (c) some practical applications of microbiology such as microbiological analysis of wastewater, and identification of clinical isolates.\",\n    \"id\": \"BIOSC1855\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0060 or 0067 or 0068 or 0191 or 0080 or BIOL 0102 or 0121 (MIN GRADE 'C'); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MICROBIOLOGY LABORATORY\",\n    \"classNumber\": \"1860\",\n    \"coreq\": [],\n    \"credits\": \"2 units\",\n    \"description\": \"This laboratory course introduces basic techniques used for isolation of microorganisms in pure culture, identification of groups of microorganisms, and study of microbial physiology, genetics, and ecology.  Some topics in applied microbiology that are covered include food microbiology, water and waste water analysis, and identification and antibiotic sensitivity-testing of pathogenic isolates.  Viruses, archaebacterial, bacteria, algae, protozoa, and fungi that students isolate from soil, pond water, human skin, and other sources are used to illustrate these methods.\",\n    \"id\": \"BIOSC1860\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0060 or 0067 or 0068 or 0191 or 0080 or BIOL 0102 or 0121) (MIN GRADE 'C'); CREQ\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"MICROBIOLOGY LABORATORY WRITING PRACTICUM\",\n    \"classNumber\": \"1861\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"Course is a writing practicum for microbiology laboratory, BIOSC 1860.  Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 1860.\",\n    \"id\": \"BIOSC1861\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"ENG 0102 or ENGCMP (0002 or 0006 or 0020 or 0200 or 0203 or 0205 or 0207 or 0208 or 0210 or 0212) or ENGFLM 0210 or FP (0003 or 0006); CREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MICROBIAL PHYSIOLOGY\",\n    \"classNumber\": \"1865\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This course examines the diversity of microbial life from a physiological point of view.  We will examine the fundamental processes of microbial metabolism in diverse organisms, and develop a framework for understanding how organisms use different approaches to solve specific needs.  Lecture material is appropriate for students trained in introductory microbiology and in biochemistry.\",\n    \"id\": \"BIOSC1865\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 1850 and (BIOSC 1000 or 1810); Minimum Grade 'C'\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"INDEPENDENT STUDY\",\n    \"classNumber\": \"1901\",\n    \"coreq\": [],\n    \"credits\": 0,\n    \"description\": \"\",\n    \"id\": \"BIOSC1901\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"UNDERGRADUATE RESEARCH\",\n    \"classNumber\": \"1903\",\n    \"coreq\": [],\n    \"credits\": 0,\n    \"description\": \"\",\n    \"id\": \"BIOSC1903\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"UNDERGRADUATE HONORS RESEARCH\",\n    \"classNumber\": \"1904\",\n    \"coreq\": [],\n    \"credits\": 0,\n    \"description\": \"\",\n    \"id\": \"BIOSC1904\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MOLECULAR BIOLOGY\",\n    \"classNumber\": \"1940\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"Course will examine the molecular basis of life processes, with a primary emphasis on genes (what they are, what they do, how they determine the properties of an organism). Topics covered will include replication of DNA, transcription of DNA into rna, and translation of RNA into protein. Much of the course will be concerned with how these processes are regulated in response to changes in the environment, and how this regulation relates to the observed properties and behavior of the organism.\",\n    \"id\": \"BIOSC1940\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"(BIOSC 0350 or 0355 or BIOL 0350 or 0203) and (BIOSC 1000 or 1810) (MIN GRADE 'C')\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MOLECULAR GENETICS LABORATORY\",\n    \"classNumber\": \"1950\",\n    \"coreq\": [],\n    \"credits\": \"2 units\",\n    \"description\": \"This course will discuss the theories and methodologies that have recently emerged as the central theme of modern molecular genetics. Lectures will emphasize descriptions and applications of techniques such as molecular cloning, restriction site mapping, in vitro mutagenesis, the polymerase chain reaction and DNA sequence analysis that have led to the recent explosion in knowledge about chromosome organization, gene structure, and the regulation of gene expression.  Laboratory sessions will emphasize polymerase chain reaction, agarose gel electrophoresis, cloning DNA fragments, bacterial transformation, restriction analysis, and the sanger method of sequencing DNA.\",\n    \"id\": \"BIOSC1950\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 0060 or 0067 or 0068 or 0191 or 0080 or BIOL 0102 or 0121 (MIN GRADE 'C'); CREQ\"\n    ],\n    \"recitation\": true\n}",
        "{\n    \"className\": \"MOLECULAR GENETICS LABORATORY WRITING PRACTICUM\",\n    \"classNumber\": \"1951\",\n    \"coreq\": [],\n    \"credits\": \"1 units\",\n    \"description\": \"Course is a writing practicum for molecular genetics laboratory, BIOSC 1950.  Students will prepare laboratory reports and write essays based on exercises and assignments for the companion course, BIOSC 1950.\",\n    \"id\": \"BIOSC1951\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"Molecular Biology (BS)\\n\\nPREQ\"\n    ],\n    \"recitation\": false\n}",
        "{\n    \"className\": \"MEDICAL MICROBIOLOGY\",\n    \"classNumber\": \"1999\",\n    \"coreq\": [],\n    \"credits\": \"3 units\",\n    \"description\": \"This is an advanced level lecture course educating students in the microbial aspects of human infectious diseases.  Students will learn about the microbial basis of infection, the host response, and the nature of specific infections within the human body.  The course also will present approaches for the diagnosis of infections and strategies for disease control.  The topics of medical microbiology will be presented in a system-based rather than an organism-based approach.\",\n    \"id\": \"BIOSC1999\",\n    \"major\": \"BIOSC\",\n    \"prereq\": [\n        \"BIOSC 1850 (MIN GRADE 'C')\"\n    ],\n    \"recitation\": false\n}"
    ]
}